In [1]:
import pandas as pd

In [3]:
dicionario = {}
dicionario['Elemento 1'] = 'Valor 1'
dicionario['Elemento 2'] = 'Valor 2'
dicionario

{'Elemento 1': 'Valor 1', 'Elemento 2': 'Valor 2'}

In [5]:
# dicionario de notas
alunos = {'Beatriz': [10.0, 4.0, 8.0, 10.0],
          'Ana': [4.0, 7.0, 7.5, 10.0],
          'José': [2.0, 4.5, 4.5, 8.0]}
alunos

{'Beatriz': [10.0, 4.0, 8.0, 10.0],
 'Ana': [4.0, 7.0, 7.5, 10.0],
 'José': [2.0, 4.5, 4.5, 8.0]}

In [6]:
# criando o dataframe
df = pd.DataFrame({'Nome': ['Beatriz', 'Alvaro'], 'Sobrenome': ['Nascimento', 'Duarte'], 'Idade': [22, 32]})

# imprimindo o dataframe
df

      Nome   Sobrenome  Idade
0  Beatriz  Nascimento     22
1   Alvaro      Duarte     32

In [13]:
# a ideia é dar erro
df_error = pd.DataFrame({'Nome':'Beatriz', 'Idade': 22}, index=range(1,2))
df_error

      Nome  Idade
1  Beatriz     22

In [14]:
# criando um dataframe
df = pd.DataFrame({'Nome': ['Braund, Mr. Owen Harris', 'Allen, Mr. William Henry', 'Bonnell, Miss. Elizabeth'],
                   'Idade': [22, 35, 58],
                   'Sexo': ['Masculino', 'Masculino', 'Feminino']})

# visualizando o nosso dataframe
df

                       Nome  Idade       Sexo
0   Braund, Mr. Owen Harris     22  Masculino
1  Allen, Mr. William Henry     35  Masculino
2  Bonnell, Miss. Elizabeth     58   Feminino

In [20]:
# dicionario de notas
alunos = pd.DataFrame({'nome': ['Ana', 'Beatriz', 'Bernardo', 'Valentin', 'Sofia'],
          'nota': [4.0, 7.0, 7.5, 10.0,15.0],})
alunos
alunos.set_index(['nome'])

          nota
nome
Ana        4.0
Beatriz    7.0
Bernardo   7.5
Valentin  10.0
Sofia     15.0

In [25]:
df = pd.read_csv('salarios.csv')
df
# df.rename(columns={'Name': 'Nome', 'Position Title': 'Cargo', 'Department': 'Departamento', 'Employee Annual Salary': 'Salário Anual'}, inplace=True)
# df

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88967.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00
...,...,...,...,...
32177,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$86520.00
32178,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$83616.00
32179,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$86520.00
32180,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$110352.00
32181,NaN,NaN,NaN,NaN

In [26]:
# criando novo dataframe
exemplo = pd.DataFrame({'Nome': ['Valentina', 'Anastácio', 'Joseph'], 'Sexo': ['F', 'M', 'M'], 'Dia nascimento': [2, 3, 2]})

# visualizando o dataframe exemplo
exemplo

        Nome Sexo  Dia nascimento
0  Valentina    F               2
1  Anastácio    M               3
2     Joseph    M               2

In [27]:
#Criando a nova coluna
exemplo['Mês de nascimento'] = ['Setembro', 'Outubro', 'Julho']

# visualizando o dataframe exemplo
exemplo

        Nome Sexo  Dia nascimento Mês de nascimento
0  Valentina    F               2          Setembro
1  Anastácio    M               3           Outubro
2     Joseph    M               2             Julho

In [28]:
df.shape

(32182, 4)

In [29]:
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88967.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32182 entries, 0 to 32181
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32181 non-null  object
 1   Position Title          32181 non-null  object
 2   Department              32181 non-null  object
 3   Employee Annual Salary  32181 non-null  object
dtypes: object(4)
memory usage: 1005.8+ KB

In [31]:
df.dropna()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88967.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00
...,...,...,...,...
32176,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$97448.00
32177,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$86520.00
32178,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$83616.00
32179,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$86520.00
32180,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$110352.00

In [37]:
df['Employee Annual Salary'].describe()
# df.keys()

count         32181
unique         1106
top       $86520.00
freq           2497
Name: Employee Annual Salary, dtype: object